---
kind: method
id: M:Autodesk.Revit.DB.CurveByPointsArrayIterator.#ctor
source: html/72917ce8-f41d-fae6-122a-741af64ce2a1.htm
---
# Autodesk.Revit.DB.CurveByPointsArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public CurveByPointsArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.